{
  "article": 371,
  "title": "Special provision with respect to the States of Maharashtra and Gujarat",
  "text": "Notwithstanding anything in this Constitution, during a period of ten years from the commencement thereof, or during such longer or shorter period as Parliament may by law provide in respect of any State, the Government of every State specified in Part B of the First Schedule shall be under the general control of, and comply with such particular directions, if any, as may from time to time be given by, the President:\n⁠\nProvided that the President may by order direct that the provisions of this article shall not apply to any State specified in the order.\nSUMMARY\n13 October 1949\n. It declared that for a period of ten years after the Constitution was introduced, the Government of every State mentioned in Part III of First Schedule of the Draft Constitution 1948 would be under the general control and supervision of the Central Government. The Draft Article further specified that a failure of any State to abide by these provisions would be taken as a failure of the State to act in accordance with the Constitution.\nMany Members welcomed the provisions of the Draft Article. One Member\nwa\nnted\nthe power of central control and supervision of the States to continue beyond ten years and be extended for an indefinite period. He\nbelieved\nthat ten years was not sufficient time to solve the problems of the States. A few Members\nnoted\nthe stark difference in the conditions of the Provinces and the States as an indication that the Draft Article was necessary. They argued that the States were administratively and politically less experienced than the Provinces.\nOne Member\nadded\nthat the Draft Article was a preventive measure that would allow the Centre to intervene in the administration of States if extraordinary circumstances were to arise. Another Member also\ncautioned\nthe Assembly to the fact that many of these States were border States and considering the troubled relationship India shared with Pakistan, it would make sense to have greater central vigilance of these States.\nOne Member\nopposed\nthe differential treatment meted out to the States in relation to the Provinces and claimed that the Draft Article went against democratic principles. According to him, the subordination of the States to the authority of the Centre meant that bureaucratic rule would dominate over any actual representative government in these States. Another Member\nechoed\nthis sentiment, insisting that people of the States had always fought for a common Constitution assuming that “\nthere would be no differentiation between the Provinces and States”.\nThis Member was ready to accept the provisions of the Article for the overall stability of the country, but\ninsisted\nthat not all States in Part III of First Schedule should be brought under the provisions of the Draft Article.\nThough multiple amendments were introduced in the Assembly, none were accepted. The Draft Article was\nadopted\nas a part of the Constitution on 13 October 1949.\nSubsequent Parliamentary Acts including constitutional amendments such as the\nConstitutional Amendment Act, 1956\nand\nConstitutional Amendment Act, 1973\nreplaced Article 371 with a new Article and made significant changes to its provisions.\nWe are a not-for-profit initiative. Your support is crucial to help us grow and maintain our commitment to providing free and open access constitutional educational resources.\nSUPPORT US\n© 2025 Centre for Law and Policy Research Trust. All Rights Reserved.\nAbout Us\nBlog\nEvents\nSubscribe\nPrivacy Policy",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-371",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}