{
  "article": 275,
  "title": "Grants from the Union to certain States",
  "text": "(1) Such sums as Parliament may by law provide shall be charged on the Consolidated Fund of India in each year as grants-in-aid of the revenues of such States as Parliament may determine to be in need of assistance, and different sums may be fixed for different States:\n⁠\nProvided that there shall be paid out of the Consolidated Fund of India as grants-in-aid of the revenues of a State such capital and recurring sums as may be necessary to enable that State to meet the costs of such schemes of development as may be undertaken by the State with the approval of the Government of India for the purpose of promoting the welfare of the Scheduled Tribes in that State or raising the level of administration of the Scheduled Areas therein to that of the administration of the rest of the areas of that State:\n⁠\nProvided further that there shall be paid out of the Consolidated Fund of India as grants-in-aid of the revenues of the State of Assam sums, capital and recurring, equivalent to—\n(a) the average excess of expenditure over the revenues during the two years immediately preceding the commencement of this Constitution in respect of the administration of the tribal areas specified in Part A of the table appended to paragraph 20 of the Sixth Schedule; and\n(b) the costs of such schemes of development as may be undertaken by that State with the approval of the Government of India for the purpose of raising the level of administration of the said areas to that of the administration of the rest of the areas of that State.\n⁠\n(2) Until provision is made by Parliament under clause (1), the powers conferred on Parliament under that clause shall be exercisable by the President by order and any order made by the President under this clause shall have effect subject to any provision so made by Parliament:\n⁠\nProvided that after a Finance Commission has been constituted no order shall be made under this clause by the President except after considering the recommendations of the Finance Commission.\nSUMMARY\n8 August 1949\nand\n9 August 1949\n. It empowered Parliament to make law to provide financial assistance to States in the form of grants-in-aid charged to the revenue of India. The Draft Article also mandated that States which were erstwhile British provinces would be compensated for their expenditure on promoting the welfare of Scheduled Tribes and administering Scheduled Areas. Assam was also to be provided grants-in-aid for administering tribal areas specified in Part I of the Sixth Schedule.\nThe Chairman of the Drafting Committee\nproposed\nminor amendments to this Draft Article. First, to change the phrase ‘\nrevenues of India\n’ to ‘\nConsolidated Fund of India\n’. Second, to include all States for the mandatory provision of compensation for expenditure on Scheduled Tribes and tribal areas. Third, to change the manner of calculating grants-in-aid to be given to Assam.\nSome Members\nopposed\nthe Draft Article as it empowered the Parliament to make laws on financial assistance given to States. They believed that it would cause conflict among representatives of various States. A Member\nproposed\nthat President should determine the grants-in-aid to be provided to States.\nSome Members\nraised\nconcerns in relation to the constitution of tribal areas. The Draft Article refers to the powers of State governments to administer tribal areas however, the constitution of tribal areas was yet to be decided. A member\nproposed\nthat this Draft Article should be discussed after tribal areas have been constituted and that all the tribal areas should be integrated into one province and administered by an autonomous body under the Union government – this would be in line with principles of self-determination.\nAfter heated discussions, the Assembly adopted the amendments.\nA Member\nmoved\na minor amendment to the amendment proposed by the Chairman of the Drafting Committee to provide that until the Parliament determines by law the amount to be distributed to States, the President would have the discretion to allocate grants-in-aid to the States. This amendment was\nadopted\n.",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-275",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}