{
  "article": 280,
  "title": "Finance Commission",
  "text": "(1) The President shall, within two years from the commencement of this Constitution and thereafter at the expiration of every fifth year or at such earlier time as the President considers necessary, by order constitute a Finance Commission which shall consist of a Chairman and four other members to be appointed by the President.\n⁠\n(2) Parliament may by law determine the qualifications which shall be requisite for appointment as members of the Commission and the manner in which they shall be selected.\n⁠\n(3) It shall be the duty of the Commission to make recommendations to the President as to—\n(a) the distribution between the Union and the States of the net proceeds of taxes which are to be, or may be, divided between them under this Chapter and the allocation between the States of the respective shares of such proceeds;\n(b) the principles which should govern the grants-in-aid of the revenues of the States out of the Consolidated Fund of India;\n(c) the continuance or modification of the terms of any agreement entered into by the Government of India with the Government of any State specified in Part B of the First Schedule under clause (1) of article 278 or under article 306; and\n(d) any other matter referred to the Commission by the President in the interests of sound finance.\n(4) The Commission shall determine their procedure and shall have such powers in the performance of their functions as Parliament may by law confer on them.\nSUMMARY\n9 August 1949\nand\n10 August 1949\n. It empowered the President to, after 5 years from the commencement of the Constitution, constitute a Finance Commission every 5 years consisting of a Chairman and 4 other members. Parliament would determine the qualifications of Commission’s members and procedures. Draft Article 260 also laid down the duties of the Finance Commission.\nThe Chairman of the Drafting Committee\nproposed\nto amend the Draft Article to state that the President would be empowered after 2 years from the commencement of the Constitution to constitute a Finance Commission instead of 5 years. He also\nmoved\na minor amendment to change the term ‘revenues of India’ to ‘Consolidated Fund of India’.\nMost Members were in support of these amendments. The Assembly\nadopted\nthese amendments.\nAnother Member\nmoved\na separate amendment to restrict the powers of the Finance Commission to alter the fixed percentages of distribution of revenue between the Union and States. Further, he did not want the Finance Commission to determine how much percentage of the excise duty should be allocated to States\nciting\nthe example of the Australian Finance Commission.\nA Member\nopposed\nthis amendment on the ground that the Finance Commission would merely make recommendations to the President and these recommendations are not binding on the President of India. The Chairman of the Drafting Committee also\nresponded\nstating that the discretion of the President has not been altered by this Draft Article and the recommendations can substantiate the President’s decision when States question the allocation. The Assembly\nrejected\nthis amendment restricting the powers of the Finance Commission.\nThe Draft Article, as amended, was adopted on\n10 August 1949\n.\nIn\n1992\n, Article 280 was amended to expand the duties of the Finance Commission – to make recommendations to the President on increasing funds in the Consolidated Fund of a State to supplement the resources of the Panchayats and Municipalities in the State on the basis of the recommendations made by the Finance Commission of the State.\nWe are a not-for-profit initiative. Your support is crucial to help us grow and maintain our commitment to providing free and open access constitutional educational resources.\nSUPPORT US\n© 2025 Centre for Law and Policy Research Trust. All Rights Reserved.\nAbout Us\nBlog\nEvents\nSubscribe\nPrivacy Policy",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-280",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}