{
  "article": 292,
  "title": "Borrowing by the Government of Indi",
  "text": "The executive power of the Union extends to borrowing upon the security of the Consolidated Fund of India within such limits, if any, as may from time to time be fixed by Parliament by law and to the giving of guarantees within such limits, if any, as may be so fixed.\nSUMMARY\n10 August 1949\n. This Draft Article provided that the Union could borrow funds and give guarantees against the revenues of India within the limits fixed by law as a part of its executive powers.\nThe Chairman of the Drafting Committee\nproposed\na minor amendment to the Draft Article- to replace the term ‘revenues of India’ with ‘Consolidated Fund of India’.\nA Member\nexpressed\nconcern that during operation of the Draft Article, the Executive should not take the entire responsibility on itself and instead place the matter before Parliament. Some Members\nbelieved\nthat the Union Executive should not be given such wide powers and Parliament should be vested with more powers in this matter.\nThe Chairman of the Drafting Committee\nreassured\nthat Parliament is empowered to make a law to limit the powers of the Union Executive to borrow funds under this Draft Article. Therefore, he believed there was no need to further limit the powers of the Union Executive under this Draft Article.\nThe minor amendment proposed by the Chairman of the Drafting Committee was\naccepted\n.\nThe Draft Article as amended was adopted on\n10 August 1949\n.\nWe are a not-for-profit initiative. Your support is crucial to help us grow and maintain our commitment to providing free and open access constitutional educational resources.\nSUPPORT US\n© 2025 Centre for Law and Policy Research Trust. All Rights Reserved.\nAbout Us\nBlog\nEvents\nSubscribe\nPrivacy Policy",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-292",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}