{
  "article": 287,
  "title": "Exemption from taxes on electricity",
  "text": "Save in so far as Parliament may by law otherwise provide, no law of a State shall impose, or authorise the imposition of, a tax on the consumption or sale of electricity (whether produced by a Government or other persons) which is—\n(a) consumed by the Government of India, or sold to the Government of India for consumption by that Government; or\n(b) consumed in the construction, maintenance or operation of any railway by the Government of India or a railway company operating that railway, or sold to that Government or any such railway company for consumption in the construction, maintenance or operation of any railway,\nand any such law imposing, or authorising the imposition of, a tax on the sale of electricity shall secure that the price of electricity sold to the Government of India for consumption by that Government, or to any such railway company as aforesaid for consumption in the construction, maintenance or operation of any railway, shall be less by the amount of the tax than the price charged to other consumers of a substantial quantity of electricity.\nSUMMARY\n9 September 1949\n. This Draft Article prohibited States from imposing taxes on sale and consumption of electricity by the Union Government and Union Railways. The Parliament was empowered to permit States to impose taxes on sale of electricity to the Union provided the final price for such sale is lesser than the price offered to other consumers.\nThe Chairman of the Drafting Committee\nproposed\na minor amendment to substitute ‘any railways’ in place of ‘Union railways’.  The Assembly\nadopted\nthis amendment without any debate.\nAnother member\nproposed\nthat Parliament should not be given any power to make a law to permit the States to impose such taxes. However, the Assembly\nrejected\nthis amendment without any debate.",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-287",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}