{
  "article": 270,
  "title": "Taxes levied and distributed between the Union and the States",
  "text": "(1) Taxes on income other than agricultural income shall be levied and collected by the Government of India and distributed between the Union and the States in the manner provided in clause (2).\n⁠\n(2) Such percentage, as may be prescribed, of the net proceeds in any financial year of any such tax, except in so far as those proceeds represent proceeds attributable to States specified in Part C of the First Schedule or to taxes payable in respect of Union emoluments, shall not form part of the Consolidated Fund of India, but shall be assigned to the States within which that tax is leviable in that year, and shall be distributed among those States in such manner and from such time as may be prescribed.\n(3) For the purposes of clause (2), in each financial year such percentage as may be prescribed of so much of the net proceeds of taxes on income as does not represent the net proceeds of taxes payable in respect of Union emoluments shall be deemed to represent proceeds attributable to States specified in Part C of the First Schedule.\n⁠\n(4) In this article—\n(a) “taxes on income” does not include a corporation tax;\n(b) “prescribed” means—\n(i) until a Finance Commission has been constituted, prescribed by the President by order, and\n(ii) after a Finance Commission has been constituted, prescribed by the President by order after considering the recommendations of the Finance Commission;\n⁠\n(c) “Union emoluments” includes all emoluments and pensions payable out of the Consolidated Fund of India in respect of which income-tax is chargeable.\nSUMMARY\n5 August 1949\n. It laid down the manner of collection and distribution of of income taxes between the Union and States. This Draft Article provided that the taxes on income excluding agricultural income would be collected by the Union government and then distributed between the Union and States in accordance with this provision. The percentage and manner of distribution of such revenues would be prescribed by the President on considering the recommendations of the Finance Commission.\nA Member\nproposed\nthat a minimum percentage of revenue and manner of distribution be detailed within the Draft Article itself. He\nbelieved\nthat this fixed percentage would provide certainty to State Governments and enable them to plan their budget. The Chairman of the Drafting Committee\nargued\nthat the Constitution should not prescribe a fixed percentage of revenue share for the States, the President should decide. The amendment was\nwithdrawn\nafter the Chairman’s response.\nAnother member\nproposed\nthat Parliament by law should determine the amount and manner of distribution of the taxes between the Union and States instead of the President. He felt that the recommendations of the Finance Commission must be debated in the Parliament and an appropriate legislation must be passed. The Chairman of the Drafting Committee\nopposed\nthis amendment because it would create conflict among representatives of various States. He also believed that the distribution may not be just as some states would have more representatives in the Parliament than others. The Assembly rejected the amendment.\nThe Assembly\naccepted\na minor amendment to replace the words ‘revenues of India’ with ‘Consolidated Fund of India’.",
  "source": "constitutionofindia.net",
  "url": "https://www.constitutionofindia.net/articles/article-270",
  "source_type": "constitution",
  "jurisdiction": "India",
  "version": "Constitution of India, 1950"
}